nxp-appcodehub/rd-motion-control-slave-servo-mimxrt1180/common/drivers/fsl_lpadc.h
#if defined(FSL_FEATURE_LPADC_HAS_CFG_CALOFS) && FSL_FEATURE_LPADC_HAS_CFG_CALOFS
/*!
 * @brief Enable the calibration function.
 *
 * When CALOFS is set, the ADC is configured to perform a calibration function anytime the ADC executes
 * a conversion. Any channel selected is ignored and the value returned in the RESFIFO is a signed value
 * between -31 and 31. -32 is not a valid and is never a returned value. Software should copy the lower 6-
 * bits of the conversion result stored in the RESFIFO after a completed calibration conversion to the
 * OFSTRIM field. The OFSTRIM field is used in normal operation for offset correction.
 *
 * @param base LPADC peripheral base address.
 * @param enable switcher to the calibration function.
 */
void LPADC_EnableCalibration(ADC_Type *base, bool enable);
#if defined(FSL_FEATURE_LPADC_HAS_OFSTRIM) && FSL_FEATURE_LPADC_HAS_OFSTRIM
/*!
 * @brief Set proper offset value to trim ADC.
 *
 * To minimize the offset during normal operation, software should read the conversion result from
 * the RESFIFO calibration operation and write the lower 6 bits to the OFSTRIM register.
 *
 * @param base  LPADC peripheral base address.
 * @param value Setting offset value.
 */
static inline void LPADC_SetOffsetValue(ADC_Type *base, uint32_t value)
{
    base->OFSTRIM = (value & ADC_OFSTRIM_OFSTRIM_MASK) >> ADC_OFSTRIM_OFSTRIM_SHIFT;
}

/*!
 * @brief Do auto calibration.
 *
 * Calibration function should be executed before using converter in application. It used the software trigger and a
 * dummy conversion, get the offset and write them into the OFSTRIM register. It called some of functional API
 * including: -LPADC_EnableCalibration(...) -LPADC_LPADC_SetOffsetValue(...) -LPADC_SetConvCommandConfig(...)
 *   -LPADC_SetConvTriggerConfig(...)
 *
 * @param base  LPADC peripheral base address.
 */
void LPADC_DoAutoCalibration(ADC_Type *base);
#endif /* defined(FSL_FEATURE_LPADC_HAS_OFSTRIM) && FSL_FEATURE_LPADC_HAS_OFSTRIM */
#endif /* defined(FSL_FEATURE_LPADC_HAS_CFG_CALOFS) && FSL_FEATURE_LPADC_HAS_CFG_CALOFS */

#if defined(FSL_FEATURE_LPADC_HAS_CTRL_CALOFS) && FSL_FEATURE_LPADC_HAS_CTRL_CALOFS
#if defined(FSL_FEATURE_LPADC_HAS_OFSTRIM) && FSL_FEATURE_LPADC_HAS_OFSTRIM
#if defined(FSL_FEATURE_LPADC_OFSTRIM_COUNT) && (FSL_FEATURE_LPADC_OFSTRIM_COUNT == 1U)
/*!
 * @brief Set trim value for offset.
 *
 * @note For 16-bit conversions, each increment is 1/2 LSB resulting in a programmable offset range of -256 LSB to 255.5
 * LSB; For 12-bit conversions, each increment is 1/32 LSB resulting in a programmable offset range of -16 LSB to
 * 15.96875 LSB.
 *
 * @param base LPADC peripheral base address.
 * @param value Offset trim value, is a 10-bit signed value between -512 and 511.
 */
static inline void LPADC_SetOffsetValue(ADC_Type *base, int16_t value)
{
    assert((value >= -512) && (value <= 511));

    base->OFSTRIM = ADC_OFSTRIM_OFSTRIM(value);
}

/*!
 * @brief Get trim value of offset.
 *
 * @param base LPADC peripheral base address.
 * @param pValue Pointer to the variable in type of int16_t to store offset value.
 */
static inline void LPADC_GetOffsetValue(ADC_Type *base, int16_t *pValue)
{
    assert(pValue != NULL);

    uint16_t ofstrim = (uint16_t)((base->OFSTRIM & (ADC_OFSTRIM_OFSTRIM_MASK)) >> ADC_OFSTRIM_OFSTRIM_SHIFT);

    if ((ofstrim & ADC_OFSTRIM_OFSTRIM_SIGN) != 0U)
    {
        /* If the sign bit is set, then set the other MSB. */
        ofstrim |= (uint16_t)(~ADC_OFSTRIM_OFSTRIM_MAX);
    }

    *pValue = (int16_t)ofstrim;
}
#elif (defined(FSL_FEATURE_LPADC_OFSTRIM_COUNT) && (FSL_FEATURE_LPADC_OFSTRIM_COUNT == 2U))
/*!
 * @brief Set proper offset value to trim ADC.
 *
 * Set the offset trim value for offset calibration manually.
 *
 * @param base  LPADC peripheral base address.
 * @param valueA Setting offset value A.
 * @param valueB Setting offset value B.
 * @note In normal adc sequence, the values are automatically calculated by LPADC_EnableOffsetCalibration.
 */
static inline void LPADC_SetOffsetValue(ADC_Type *base, int32_t valueA, int32_t valueB)
{
    assert((valueA >= -16) && (valueA <= 15));
    assert((valueB >= -16) && (valueB <= 15));

    base->OFSTRIM = ADC_OFSTRIM_OFSTRIM_A(valueA) | ADC_OFSTRIM_OFSTRIM_B(valueB);
}

/*!
 * @brief Get trim value of offset.
 *
 * @param base LPADC peripheral base address.
 * @param pValueA Pointer to the variable in type of int32_t to store offset A value.
 * @param pValueB Pointer to the variable in type of int32_t to store offset B value.
 */
static inline void LPADC_GetOffsetValue(ADC_Type *base, int32_t *pValueA, int32_t *pValueB)
{
    assert(pValueA != NULL);
    assert(pValueB != NULL);

    uint32_t ofstrimA = (base->OFSTRIM & (ADC_OFSTRIM_OFSTRIM_A_MASK)) >> ADC_OFSTRIM_OFSTRIM_A_SHIFT;
    uint32_t ofstrimB = (base->OFSTRIM & (ADC_OFSTRIM_OFSTRIM_B_MASK)) >> ADC_OFSTRIM_OFSTRIM_B_SHIFT;

    if ((ofstrimA & ADC_OFSTRIM_OFSTRIM_A_SIGN) != 0U)
    {
        /* If the sign bit is set, then set the other MSB. */
        ofstrimA |= (~ADC_OFSTRIM_OFSTRIM_A_MAX);
    }
    if ((ofstrimB & ADC_OFSTRIM_OFSTRIM_B_SIGN) != 0U)
    {
        /* If the sign bit is set, then set the other MSB. */
        ofstrimB |= (~ADC_OFSTRIM_OFSTRIM_B_MAX);
    }

    *pValueA = (int32_t)ofstrimA;
    *pValueB = (int32_t)ofstrimB;
}
#endif /* defined(FSL_FEATURE_LPADC_OFSTRIM_COUNT) */
#else  /* !(defined(FSL_FEATURE_LPADC_HAS_OFSTRIM) && FSL_FEATURE_LPADC_HAS_OFSTRIM) */
/*!
 * @brief Set proper offset value to trim 12 bit ADC conversion.
 *
 * Set the offset trim value for offset calibration manually.
 *
 * @param base  LPADC peripheral base address.
 * @param valueA Setting offset value A.
 * @param valueB Setting offset value B.
 * @note In normal adc sequence, the values are automatically calculated by LPADC_EnableOffsetCalibration.
 */
static inline void LPADC_SetOffset12BitValue(ADC_Type *base, uint32_t valueA, uint32_t valueB)
{
    base->OFSTRIM12 = ADC_OFSTRIM12_OFSTRIM_A(valueA) | ADC_OFSTRIM12_OFSTRIM_A(valueB);
}

/*!
 * @brief Set proper offset value to trim 16 bit ADC conversion.
 *
 * Set the offset trim value for offset calibration manually.
 *
 * @param base  LPADC peripheral base address.
 * @param valueA Setting offset value A.
 * @param valueB Setting offset value B.
 * @note In normal adc sequence, the values are automatically calculated by LPADC_EnableOffsetCalibration.
 */
static inline void LPADC_SetOffset16BitValue(ADC_Type *base, uint32_t valueA, uint32_t valueB)
{
    base->OFSTRIM16 = ADC_OFSTRIM16_OFSTRIM_A(valueA) | ADC_OFSTRIM16_OFSTRIM_B(valueB);
}
#endif /* FSL_FEATURE_LPADC_HAS_OFSTRIM */

/*!
 * @brief Enable the offset calibration function.
 *
 * @param base LPADC peripheral base address.
 * @param enable switcher to the calibration function.
 */
static inline void LPADC_EnableOffsetCalibration(ADC_Type *base, bool enable)
{
    if (enable)
    {
        base->CTRL |= ADC_CTRL_CALOFS_MASK;
    }
    else
    {
        base->CTRL &= ~ADC_CTRL_CALOFS_MASK;
    }
}
#if defined(FSL_FEATURE_LPADC_HAS_CTRL_CALOFSMODE) && FSL_FEATURE_LPADC_HAS_CTRL_CALOFSMODE
/*!
 * @brief Set offset calibration mode.
 *
 * @param base LPADC peripheral base address.
 * @param mode set offset calibration mode.see to #lpadc_offset_calibration_mode_t .
 */
static inline void LPADC_SetOffsetCalibrationMode(ADC_Type *base, lpadc_offset_calibration_mode_t mode)
{
    base->CTRL = (base->CTRL & ~ADC_CTRL_CALOFSMODE_MASK) | ADC_CTRL_CALOFSMODE(mode);
}

#endif /* defined(FSL_FEATURE_LPADC_HAS_CTRL_CALOFSMODE) && FSL_FEATURE_LPADC_HAS_CTRL_CALOFSMODE */

/*!
 * @brief Do offset calibration.
 *
 * @param base LPADC peripheral base address.
 */
void LPADC_DoOffsetCalibration(ADC_Type *base);

#if defined(FSL_FEATURE_LPADC_HAS_CTRL_CAL_REQ) && FSL_FEATURE_LPADC_HAS_CTRL_CAL_REQ
/*!
 * @brief Do auto calibration.
 *
 * @param base  LPADC peripheral base address.
 */
void LPADC_DoAutoCalibration(ADC_Type *base);

/*!
 * @brief Prepare auto calibration, LPADC_FinishAutoCalibration has to be called before using the LPADC.
 * LPADC_DoAutoCalibration has been split in two API to avoid to be stuck too long in the function.
 *
 * @param base  LPADC peripheral base address.
 */
void LPADC_PrepareAutoCalibration(ADC_Type *base);

/*!
 * @brief Finish auto calibration start with LPADC_PrepareAutoCalibration.
 *
 * @param base  LPADC peripheral base address.
 */
void LPADC_FinishAutoCalibration(ADC_Type *base);

#endif /* defined(FSL_FEATURE_LPADC_HAS_CTRL_CAL_REQ) && FSL_FEATURE_LPADC_HAS_CTRL_CAL_REQ */

/*!
 * @brief Get calibration value into the memory which is defined by invoker.
 *
 * @note Please note the ADC will be disabled temporary.
 * @note This function should be used after finish calibration.
 *
 * @param base LPADC peripheral base address.
 * @param ptrCalibrationValue Pointer to @ref lpadc_calibration_value_t structure, this memory block should be always
 * powered on even in low power modes.
 */
void LPADC_GetCalibrationValue(ADC_Type *base, lpadc_calibration_value_t *ptrCalibrationValue);

/*!
 * @brief Set calibration value into ADC calibration registers.
 *
 * @note Please note the ADC will be disabled temporary.
 *
 * @param base LPADC peripheral base address.
 * @param ptrCalibrationValue Pointer to @ref lpadc_calibration_value_t structure which contains ADC's calibration
 * value.
 */
void LPADC_SetCalibrationValue(ADC_Type *base, const lpadc_calibration_value_t *ptrCalibrationValue);

#endif /* defined(FSL_FEATURE_LPADC_HAS_CTRL_CALOFS) && FSL_FEATURE_LPADC_HAS_CTRL_CALOFS */

#if ((defined(FSL_FEATURE_LPADC_HAS_CTRL_CALHS)) && FSL_FEATURE_LPADC_HAS_CTRL_CALHS)
/*!
 * @brief Request high speed mode trim calculation.
 *
 * @param base LPADC peripheral base address.
 */
static inline void LPADC_RequestHighSpeedModeTrim(ADC_Type *base)
{
    base->CTRL |= ADC_CTRL_CALHS_MASK;
}

/*!
 * @brief Get high speed mode trim value, the result is a 5-bit signed value between -16 and 15.
 *
 * @note The high speed mode trim value is used to minimize offset for high speed conversion.
 *
 * @param base LPADC peripheral base address.
 * @return The calculated high speed mode trim value.
 */
static inline int8_t LPADC_GetHighSpeedTrimValue(ADC_Type *base)
{
    return (int8_t)(base->HSTRIM);
}

/*!
 * @brief Set high speed mode trim value.
 *
 * @note If is possible to set the trim value manually, but it is recommended to use the LPADC_RequestHighSpeedModeTrim.
 *
 * @param base LPADC peripheral base address.
 * @param trimValue The trim value to be set.
 */
static inline void LPADC_SetHighSpeedTrimValue(ADC_Type *base, int8_t trimValue)
{
    base->HSTRIM = ADC_HSTRIM_HSTRIM(trimValue);
}

/*!
 * @brief Enable/disable high speed conversion mode, if enabled conversions complete 2 or 3 ADCK cycles sooner compared
 * to conversion cycle counts when high speed mode is disabled.
 *
 * @param base LPADC peripheral base address.
 * @param enable Used to enable/disable high speed conversion mode:
 *     - \b true Enable high speed conversion mode;
 *     - \b false Disable high speed conversion mode.
 */
static inline void LPADC_EnableHighSpeedConversionMode(ADC_Type *base, bool enable)
{
    if (enable)
    {
        base->CFG2 |= ADC_CFG2_HS_MASK;
    }
    else
    {
        base->CFG2 &= ~ADC_CFG2_HS_MASK;
    }
}

/*!
 * @brief Enable/disable an additional ADCK cycle to conversion.
 *
 * @param base LPADC peripheral base address.
 * @param enable Used to enable/disable an additional ADCK cycle to conversion:
 *          - \b true Enable an additional ADCK cycle to conversion;
 *          - \b false Disable an additional ADCK cycle to conversion.
 */
static inline void LPADC_EnableExtraCycle(ADC_Type *base, bool enable)
{
    if (enable)
    {
        base->CFG2 |= ADC_CFG2_HSEXTRA_MASK;
    }
    else
    {
        base->CFG2 &= ~ADC_CFG2_HSEXTRA_MASK;
    }
}

/*!
 * @brief Set tune value which provides some variability in how many cycles are needed to complete a conversion.
 *
 * @param base LPADC peripheral base address.
 * @param tuneValue The tune value to be set, please refer to @ref lpadc_tune_value_t.
 */
static inline void LPADC_SetTuneValue(ADC_Type *base, lpadc_tune_value_t tuneValue)
{
    base->CFG2 = (base->CFG2 & ~ADC_CFG2_TUNE_MASK) | ADC_CFG2_TUNE(tuneValue);
}

/*!
 * @brief Get tune value which provides some variability in how many cycles are needed to complete a conversion.
 *
 * @param base LPADC peripheral base address.
 * @return The tune value, please refer to @ref lpadc_tune_value_t.
 */
static inline lpadc_tune_value_t LPADC_GetTuneValue(ADC_Type *base)
{
    return (lpadc_tune_value_t)((base->CFG2 & ADC_CFG2_TUNE_MASK) >> ADC_CFG2_TUNE_SHIFT);
}
#endif /* ((defined(FSL_FEATURE_LPADC_HAS_CTRL_CALHS)) && FSL_FEATURE_LPADC_HAS_CTRL_CALHS) */

#if (defined(FSL_FEATURE_LPADC_HAS_CFG2_JLEFT) && FSL_FEATURE_LPADC_HAS_CFG2_JLEFT)
/*!
 * @brief Enable/disable left-justify format in 12-bit single-end mode.
 *
 * @param base LPADC peripheral base address.
 * @param enable Used to enable/disable left-justify format in 12-bit single-end mode:
 *          - \b true Enable left-justify format in 12-bit single-end mode;
 *          - \b false Disable left-justify format in 12-bit single-end mode.
 */
static inline void LPADC_EnableJustifiedLeft(ADC_Type *base, bool enable)
{
    if (enable)
    {
        base->CFG2 |= ADC_CFG2_JLEFT_MASK;
    }
    else
    {
        base->CFG2 &= ~ADC_CFG2_JLEFT_MASK;
    }
}
#endif /* (defined(FSL_FEATURE_LPADC_HAS_CFG2_JLEFT) && FSL_FEATURE_LPADC_HAS_CFG2_JLEFT) */

/* @} */

#if defined(__cplusplus)
}
#endif
/*!
 * @}
 */
#endif /* FSL_LPADC_H_ */
